sii/xml_examples/alta_factura_emitida_rectificativa_sustitucion.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
                  xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <siiLR:SuministroLRFacturasEmitidas>
            <sii:Cabecera>
                <sii:IDVersionSii>0.6</sii:IDVersionSii>
                <sii:Titular>
                    <sii:NombreRazon>EMPRESAXXXX</sii:NombreRazon>
                    <sii:NIF>A84532501</sii:NIF>
                </sii:Titular>
                <sii:TipoComunicacion>A0</sii:TipoComunicacion>
            </sii:Cabecera>
            <siiLR:RegistroLRFacturasEmitidas>
                <sii:PeriodoImpositivo>
                    <sii:Ejercicio>2015</sii:Ejercicio>
                    <sii:Periodo>01</sii:Periodo>
                </sii:PeriodoImpositivo>
                <siiLR:IDFactura>
                    <sii:IDEmisorFactura>
                        <sii:NIF>A84532501</sii:NIF>
                    </sii:IDEmisorFactura>
                    <sii:NumSerieFacturaEmisor>01</sii:NumSerieFacturaEmisor>
                    <sii:FechaExpedicionFacturaEmisor>15-01-2015</sii:FechaExpedicionFacturaEmisor>
                </siiLR:IDFactura>
                <siiLR:FacturaExpedida>
                    <sii:TipoFactura>F1</sii:TipoFactura>
                    <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                    <sii:ImporteTotal>-1210</sii:ImporteTotal>
                    <sii:DescripcionOperacion>CompraXXXXXXX</sii:DescripcionOperacion>
                    <sii:Contraparte>
                        <sii:NombreRazon>EMPRESAYYYYYYYY</sii:NombreRazon>
                        <sii:NIF>94234500B</sii:NIF>
                    </sii:Contraparte>
                    <sii:TipoDesglose>
                        <sii:DesgloseFactura>
                            <sii:Sujeta>
                                <sii:NoExenta>
                                    <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                    <sii:DesgloseIVA>
                                        <sii:DetalleIVA>
                                            <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                            <sii:BaseImponible>-1000</sii:BaseImponible>
                                            <sii:CuotaRepercutida>-210</sii:CuotaRepercutida>
                                        </sii:DetalleIVA>
                                    </sii:DesgloseIVA>
                                </sii:NoExenta>
                            </sii:Sujeta>
                        </sii:DesgloseFactura>
                    </sii:TipoDesglose>
                </siiLR:FacturaExpedida>
            </siiLR:RegistroLRFacturasEmitidas>
        </siiLR:SuministroLRFacturasEmitidas>
    </soapenv:Body>
</soapenv:Envelope>


<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
                  xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
<soapenv:Header/>
<soapenv:Body>
    <siiLR:SuministroLRFacturasEmitidas>
        <sii:Cabecera>
            <sii:IDVersionSii>0.6</sii:IDVersionSii>
            <sii:Titular>
                <sii:NombreRazon>EMPRESAXXXX</sii:NombreRazon>
                <sii:NIF>A84532501</sii:NIF>
            </sii:Titular>
            <sii:TipoComunicacion>A0</sii:TipoComunicacion>
        </sii:Cabecera>
        <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoImpositivo>
                <sii:Ejercicio>2015</sii:Ejercicio>
                <sii:Periodo>01</sii:Periodo>
            </sii:PeriodoImpositivo>
            <siiLR:IDFactura>
                <sii:IDEmisorFactura>
                    <sii:NIF>A84532501</sii:NIF>
                </sii:IDEmisorFactura>
                <sii:NumSerieFacturaEmisor>0000000000030</sii:NumSerieFacturaEmisor>
                <sii:FechaExpedicionFacturaEmisor>20-01-2015</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
                <sii:TipoFactura>R1</sii:TipoFactura>
                <sii:TipoRectificativa>S</sii:TipoRectificativa>
                <sii:ImporteRectificacion>
                    <sii:BaseRectificada>0</sii:BaseRectificada>
                    <sii:CuotaRectificada>0</sii:CuotaRectificada>
                </sii:ImporteRectificacion>
                <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
                <sii:ImporteTotal>968</sii:ImporteTotal>
                <sii:DescripcionOperacion>Objeto FACTURA</sii:DescripcionOperacion>
                <sii:EmitidaPorTerceros>S</sii:EmitidaPorTerceros>
                <sii:Contraparte>
                    <sii:NombreRazon>EMPRESAYYYYYYYY</sii:NombreRazon>
                    <sii:NIF>94234500B</sii:NIF>
                </sii:Contraparte>
                <sii:TipoDesglose>
                    <sii:DesgloseFactura>
                        <sii:Sujeta>
                            <sii:NoExenta>
                                <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                                <sii:DesgloseIVA>
                                    <sii:DetalleIVA>
                                        <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                        <sii:BaseImponible>800</sii:BaseImponible>
                                        <sii:CuotaRepercutida>168</sii:CuotaRepercutida>
                                    </sii:DetalleIVA>
                                </sii:DesgloseIVA>
                            </sii:NoExenta>
                        </sii:Sujeta>
                    </sii:DesgloseFactura>
                </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
        </siiLR:RegistroLRFacturasEmitidas>
    </siiLR:SuministroLRFacturasEmitidas>
</soapenv:Body>
</soapenv:Envelope>